# CreateRelatedFileProgressChangedEventArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CreateRelatedFileProgressChangedEventArgs Class
Members See Also
---
The event arguments used during creating related file phase of [!:Autodesk::Revit::ApplicationServices::Application::WorksharedOperationProgressChanged] in model open operation.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class CreateRelatedFileProgressChangedEventArgs : DataTransferProgressChangedEventArgs
```

Visual Basic
---
```text
Public Class CreateRelatedFileProgressChangedEventArgs _
	Inherits DataTransferProgressChangedEventArgs
```

Visual C++
---
```text
public ref class CreateRelatedFileProgressChangedEventArgs : public DataTransferProgressChangedEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPISingleEventArgs Autodesk.Revit.DB.Events..::..WorksharedOperationProgressChangedEventArgs Autodesk.Revit.DB.Events..::..DataTransferProgressChangedEventArgs Autodesk.Revit.DB.Events..::..CreateRelatedFileProgressChangedEventArgs
# See Also
CreateRelatedFileProgressChangedEventArgs Members
Autodesk.Revit.DB.Events Namespace